Конфигурация/Catalogs/ЮрФизЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ЮрФизЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЮрФизЛица</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЮрФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/РеквизитыФизическихЛицАнкетные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РеквизитыФизическихЛицАнкетные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СерияУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияДействияУдостоверенияЛичности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийУдостоверениеЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОрганаВыдавшегоУдостоверениеЛичности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентРФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВтороеГражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРНИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачиОГРНИП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганВыдавшийОГРНИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресРегистрации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресРегистрацииФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресМестаЖительства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресМестаЖительстваФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтовыйАдресФИАС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефоны</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезидентПо173ФЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелефонДляОповещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВебСтраница</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ДокументыЮридическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ДокументыЮридическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВыдавшего</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерРешения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРешения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовЮридическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ЖурналСверкиСоСписками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЖурналСверкиСоСписками</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пройдена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейСверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РеквизитыСверки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ВнутренниеПеречни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ВнутренниеПеречни</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПеречня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеречнейОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/ЮрФизЛица/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура НадписьПроверитьНажатие(Элемент)
	
	СтандартнаяОбработка = Ложь;
	СверитьПоСМЭВ(ЭтаФорма.Организация, Объект.Ссылка, ЭтаФорма.ИдентификаторПакетаСМЭВ);
	ОбновитьРезультатыСверкиПоСМЭВ();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФункциональныеРолиЮрФизЛицаНаСервере()
	// для физиков (или при пустом значении) роли не получаем
	Если Объект.ВидЮрФизЛица <> Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ФункциональныеРоли.Очистить();
	
	ВидыФункциональныхРолей     = Справочники.ЮрФизЛица.ПолучитьВидыФункциональныхРолей();
	ВыбранныеФункциональныеРоли = Справочники.ЮрФизЛица.ПолучитьФункциональныеРоли(Объект.Ссылка);
	
	Для каждого ВидФункциональнойРоли Из ВидыФункциональныхРолей Цикл
		СтрокаФункциональныеРоли = ЭтаФорма.ФункциональныеРоли.Добавить();
		СтрокаФункциональныеРоли.ВидРоли = ВидФункциональнойРоли;
		СтрокаФункциональныеРоли.Роль    = Метаданные.Справочники[ВидФункциональнойРоли].ПредставлениеОбъекта;
	КонецЦикла;
	
	Для каждого ВыбраннаяФункциональнаяРоль Из ВыбранныеФункциональныеРоли Цикл
		СтрокаФункциональныеРоли = ЭтаФорма.ФункциональныеРоли[ВидыФункциональныхРолей.Найти(ВыбраннаяФункциональнаяРоль.Метаданные().Имя)];
		СтрокаФункциональныеРоли.Флажок       = Истина;
		СтрокаФункциональныеРоли.СсылкаНаРоль = ВыбраннаяФункциональнаяРоль;
	КонецЦикла;
	
	КоличествоВыбранныхРолей = ВыбранныеФункциональныеРоли.Количество();
	
	ЭтаФорма.ФункциональныеРоли.Сортировать("Флажок УБЫВ, Роль");
	
	Если КоличествоВыбранныхРолей > 0 Тогда
		Элементы.СтраницаФункциональныеРоли.Заголовок = "Функциональные роли (" + КоличествоВыбранныхРолей + ")";
	Иначе
		Элементы.СтраницаФункциональныеРоли.Заголовок = "Функциональные роли";
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьФункциональныеРолиЮрФизЛица

&НаСервере
Процедура ДобавитьОтборыСписковНаСервере()
	
	// отбор расчетных счетов
	СписокРасчетныеСчета.Параметры.УстановитьЗначениеПараметра("Владелец",    Объект.Ссылка);
	СписокРасчетныеСчета.Параметры.УстановитьЗначениеПараметра("Организация", ПараметрыСеанса.ТекущаяОрганизация);

	// отбор контактных лиц
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокКонтактныеЛица.Отбор, "Объект",,,Объект.Ссылка,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокКонтактныеЛица.Отбор, "Подразделение",,,Подразделение,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокКонтактныеЛица.Отбор, "Язык",,,Язык,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	// отбор заявок пайщика
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокЗаявок.Отбор, "Пайщик",,,Объект.Ссылка,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокЗаявок.Отбор, "Организация",,,ПараметрыСеанса.ТекущаяОрганизация,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	
	
	// отбор счетов ДУ
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокСчетовДУ.Отбор, "ЮрФизЛицо",,,Объект.Ссылка,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокСчетовДУ.Отбор, "Организация",,,ПараметрыСеанса.ТекущаяОрганизация,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	// отбор лицевых счетов
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокЛицевыеСчета.Отбор, "ВладелецСчета",,,Объект.Ссылка,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СписокЛицевыеСчета.Отбор, "Организация",,,ПараметрыСеанса.ТекущаяОрганизация,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);	

	// отбор сотрудники организации
	СотрудникиОрганизации.Параметры.УстановитьЗначениеПараметра("Период",		ЭтаФорма.Период);
	СотрудникиОрганизации.Параметры.УстановитьЗначениеПараметра("ЮрФизЛицо",	Объект.Ссылка);
	
	// Сведения о трудовой деятельности сотрудников
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СведенияОТрудовойДеятельностиСотрудников.Отбор, "ЮрФизЛицо",,,Объект.Ссылка,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	// Сведения об образовании
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СведенияОбОбразованииФизЛиц.Отбор, "ЮрФизЛицо",,,Объект.Ссылка,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	// Сведения о квалификации
	РаботаСНастройкамиСписковКлиентСервер.ДобавитьЭлементОтбора(СведенияОКвалификацииФизическихЛиц.Отбор, "ЮрФизЛицо",,,Объект.Ссылка,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);

	// Внутренние перечни
	ВнутренниеПеречни.Параметры.УстановитьЗначениеПараметра("Период",	ЭтаФорма.Период);
	ВнутренниеПеречни.Параметры.УстановитьЗначениеПараметра("Объект",	Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеЮрФизЛицаНаСервере()
	
	Элементы.СтраницаРеквизитыЮрЛицаАнкетные.Видимость	= Ложь;
	Элементы.СтраницаРеквизитыЮрЛица.Видимость			= Ложь;
	Элементы.СтраницаРеквизитыФизЛицаАнкетные.Видимость	= Ложь;
	Элементы.СтраницаКонтактыАнкетные.Видимость			= Ложь;
	
	Элементы.СтраницаРеквизитыЮрЛицаАнкетные.Заголовок	= "Реквизиты";
	Элементы.СтраницаРеквизитыЮрЛица.Заголовок			= "Реквизиты";
	Элементы.СтраницаРеквизитыФизЛицаАнкетные.Заголовок	= "Реквизиты";
	
	Элементы.СтраницаФункциональныеРоли.Видимость
			= (Объект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо);
	Элементы.СтраницаДанныеГруппыКомпаний.Видимость
			= (Объект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо);
	Элементы.СтраницаРоли.Видимость
			= (Объект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо);
			
	Если Элементы.СтраницаРоли.Видимость Тогда 		
		Элементы.КлиентскиеРоли.ВысотаВСтрокахТаблицы = Справочники.ЮрФизЛица.ПолучитьВидыКлиентскихРолей().Количество();	
		Элементы.КлиентскиеРоли.МаксимальнаяВысотаВСтрокахТаблицы = Справочники.ЮрФизЛица.ПолучитьВидыКлиентскихРолей().Количество();	
	КонецЕсли;	
		
	Если Объект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		
		// Анкетные данные
		Если ЗначениеЗаполнено(ЭтаФорма.Анкета) Тогда
			
			Элементы.СтраницаРеквизитыФизЛицаАнкетные.Видимость = Истина;
			Элементы.СтраницаКонтактыАнкетные.Видимость			= Ложь;
			
			Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	*
				|ИЗ
				|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
				|			,
				|			ЮрФизЛицо = &ЮрФизЛицо
				|				И Организация = &Организация
				|				И Язык = &Язык
				|				И Регистратор = &Регистратор) КАК РеквизитыФизическихЛицСрезПоследних");
			
			Запрос.УстановитьПараметр("ЮрФизЛицо",   Объект.Ссылка);
			Запрос.УстановитьПараметр("Регистратор", ЭтаФорма.Анкета);
			Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
			Запрос.УстановитьПараметр("Язык",        ЭтаФорма.Язык);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(РеквизитыФизЛицаАнкетные, Выборка);	
			КонецЕсли;
			
			ЭтаФорма.Email    = Выборка.EMail;
			ЭтаФорма.Телефоны = Выборка.Телефоны;
			ЭтаФорма.Адрес1   = Выборка.АдресРегистрации;
			ЭтаФорма.Адрес2   = Выборка.АдресМестаЖительства;
			ЭтаФорма.Адрес3   = Выборка.ПочтовыйАдрес;
			
			Элементы.Адрес1.Заголовок = "Адрес регистрации";
			Элементы.Адрес2.Заголовок = "Адрес места жительства";
			Элементы.СоздатьАнкету.Заголовок = "Обновить";
			
		КонецЕсли;
			
	ИначеЕсли Объект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ЮридическоеЛицо Тогда
		
		ГоловнаяОрганизацияЮрЛица = РаботаСНормативноСправочнойИнформацией.ПолучитьГоловнуюОрганизацию(Объект.Ссылка);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущаяДатаСеанса",	ТекущаяДатаСеанса());
		Запрос.УстановитьПараметр("ЮрФизЛицо",			Объект.Ссылка);
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ДокументыЮридическихЛицСрезПоследних.Период КАК ЮрЛицоДатаВыдачиОГРН,
			|	ДокументыЮридическихЛицСрезПоследних.Номер КАК ЮрЛицоОГРН,
			|	ДокументыЮридическихЛицСрезПоследних.КемВыдан КАК ЮрЛицоОрганВыдавшийОГРН
			|ИЗ
			|	РегистрСведений.ДокументыЮридическихЛиц.СрезПоследних(
			|			&ТекущаяДатаСеанса,
			|			Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
			|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
			|				И Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЮридическихЛиц.СвидетельствоОГосударственнойРегистрации)
			|				И ЮрФизЛицо = &ЮрФизЛицо) КАК ДокументыЮридическихЛицСрезПоследних
			|ГДЕ
			|	(ДокументыЮридическихЛицСрезПоследних.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
			|			ИЛИ ДокументыЮридическихЛицСрезПоследних.ДействуетПо > &ТекущаяДатаСеанса)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			ЮрЛицоОГРН				= Выборка.ЮрЛицоОГРН;
			ЮрЛицоДатаВыдачиОГРН	= Выборка.ЮрЛицоДатаВыдачиОГРН;
			ЮрЛицоОрганВыдавшийОГРН	= Выборка.ЮрЛицоОрганВыдавшийОГРН;
		Иначе
			ЮрЛицоОГРН				= Неопределено;
			ЮрЛицоДатаВыдачиОГРН	= Неопределено;
			ЮрЛицоОрганВыдавшийОГРН	= Неопределено;
		КонецЕсли;
		
		// Анкетные данные
		Если ЗначениеЗаполнено(ЭтаФорма.Анкета) Тогда
			
			Элементы.СтраницаРеквизитыЮрЛицаАнкетные.Видимость 	= Истина;
			Элементы.СтраницаКонтактыАнкетные.Видимость			= Ложь;
			
			Запрос = Новый Запрос(
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	*
				|ИЗ
				|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
				|			,
				|			ЮрФизЛицо = &ЮрФизЛицо
				|				И Организация = &Организация
				|				И Язык = &Язык
				|				И Регистратор = &Регистратор) КАК РеквизитыФизическихЛицСрезПоследних");
			
			Запрос.УстановитьПараметр("ЮрФизЛицо",   Объект.Ссылка);
			Запрос.УстановитьПараметр("Регистратор", ЭтаФорма.Анкета);
			Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
			Запрос.УстановитьПараметр("Язык",        ЭтаФорма.Язык);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(РеквизитыЮрЛицаАнкетные, Выборка);
			КонецЕсли;
			
			ЭтаФорма.Email    = Выборка.EMail;
			ЭтаФорма.Телефоны = Выборка.Телефоны;
			ЭтаФорма.Адрес1   = Выборка.ЮридическийАдрес;
			ЭтаФорма.Адрес2   = Выборка.ФактическийАдрес;
			ЭтаФорма.Адрес3   = Выборка.ПочтовыйАдрес;
			
			Элементы.Адрес1.Заголовок = "Юридический адрес";
			Элементы.Адрес2.Заголовок = "Фактический адрес";
			Элементы.СоздатьАнкету.Заголовок = "Обновить";
			
		КонецЕсли;
		
		// Данные группы компаний
		Если Не ЗначениеЗаполнено(ЭтаФорма.Анкета) Или РаботаСПользователями.ЭтоПолноправныйПользователь() Тогда
			
			Элементы.СтраницаРеквизитыЮрЛица.Видимость = Истина;
			
			Запрос = Новый Запрос("
				|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	*
				|ИЗ
				|	РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
				|			,
				|			Подразделение = &Подразделение
				|				И Язык = &Язык
				|				И ЮрФизЛицо = &ЮрФизЛицо) КАК РеквизитыФизическихЛицСрезПоследних
				|");
			
			Запрос.УстановитьПараметр("Подразделение", ЭтаФорма.Подразделение);        
			Запрос.УстановитьПараметр("Язык", ЭтаФорма.Язык);        
			Запрос.УстановитьПараметр("ЮрФизЛицо", Объект.Ссылка);        
		
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ЗаполнитьЗначенияСвойств(РеквизитыЮрЛица, Выборка);	
			КонецЕсли;
			
			Если ЭтаФорма.Элементы.Найти("ЮрЛицоКонтактнаяИнформация") = Неопределено Тогда
				РаботаСНормативноСправочнойИнформацией.СоздатьДинамическийСписокКонтактнойИнформации("ЮрЛицоКонтактнаяИнформация", ЭтаФорма, ЭтаФорма.Элементы.СтраницаКонтакты, Объект.Ссылка, Ложь);
				ЭтаФорма.Элементы.ЮрЛицоКонтактнаяИнформацияЗначенияПолей.Видимость = Ложь;			
			КонецЕсли;

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРезультатыСверкиПоСМЭВ()

	Если ЗначениеЗаполнено(ЭтаФорма.Анкета) И Объект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
	
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЖурналСверкиСоСпискамиСрезПоследних.ДатаПоследнейСверки КАК ДатаСверкиСМЭВ,
			|	ВЫБОР
			|		КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Пройдена
			|			ТОГДА ВЫБОР
			|					КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Статус = ""VALID""
			|						ТОГДА ""Пройдена""
			|					КОГДА ЖурналСверкиСоСпискамиСрезПоследних.Статус = ""INVALID""
			|						ТОГДА ""Не пройдена""
			|					ИНАЧЕ ""Ошибка выполнения запроса""
			|				КОНЕЦ
			|		ИНАЧЕ ""Запрос отправлен""
			|	КОНЕЦ КАК РезультатСверкиСМЭВ,
			|	ЖурналСверкиСоСпискамиСрезПоследних.Пройдена КАК Пройдена,
			|	ЖурналСверкиСоСпискамиСрезПоследних.ИдентификаторПакета КАК ИдентификаторПакета
			|ИЗ
			|	РегистрСведений.ЖурналСверкиСоСписками.СрезПоследних(
			|			,
			|			Организация = &Организация
			|				И ВидПеречня = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.СМЭВ)
			|				И ЮрФизЛицо = &ЮрФизЛицо) КАК ЖурналСверкиСоСпискамиСрезПоследних");

		Запрос.УстановитьПараметр("ЮрФизЛицо",   Объект.Ссылка);
		Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);

		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда			
			ЭтаФорма.ИдентификаторПакетаСМЭВ = Выборка.ИдентификаторПакета;
			ЭтаФорма.РезультатСверкиСМЭВ = Выборка.РезультатСверкиСМЭВ + " " + Выборка.ДатаСверкиСМЭВ;
		Иначе			
			ЭтаФорма.ИдентификаторПакетаСМЭВ = "";
			ЭтаФорма.РезультатСверкиСМЭВ = "Не выполнялась";
		КонецЕсли;		
		
	Иначе
		
		Элементы.ГруппаСверкаПоСМЭВ.Видимость = Ложь;
	
	КонецЕсли; 

КонецПроцедуры
 
&НаСервере
Процедура ПриЧтенииСозданииНаСервере()

	// Определелим текущую анкету, если она есть
	Если Объект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор КАК Регистратор
			|ИЗ
			|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
			|			,
			|			Организация = &Организация
			|				И ЮрФизЛицо = &ЮрФизЛицо
			|				И Язык = &Язык) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних");
		Элементы.Анкета.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.АнкетаФизическогоЛица");
	Иначе
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Регистратор КАК Регистратор
			|ИЗ
			|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
			|			,
			|			Организация = &Организация
			|				И ЮрФизЛицо = &ЮрФизЛицо
			|				И Язык = &Язык) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних");
		Элементы.Анкета.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.АнкетаЮридическогоЛица");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЮрФизЛицо",   Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("Язык",        ЭтаФорма.Язык);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЭтаФорма.Анкета = Выборка.Регистратор;
	КонецЕсли;
	
	ОбновитьДанныеЮрФизЛицаНаСервере();
	
	ЗаполнитьФункциональныеРолиЮрФизЛицаНаСервере();
	
	УстановитьСвойстваДинамическогоСпискаСотрудникиОрганизацииНаСервере();
	УстановитьСвойстваДинамическогоСпискаВнутренниеПеречниНаСервере();
	
	ДобавитьОтборыСписковНаСервере();
	
	УниверсальныеМеханизмы.УстановитьЗаголовокСсылкиОбновить(ЭтаФорма, Объект.Ссылка);
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	ОбновитьРезультатыСверкиПоСМЭВ();
	
	ЗаполнитьКлиентскиеРолиНаСервере();
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры // ПриЧтенииСозданииНаСервере

////////////////////////////////////////////////////////////////////////////////

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;

	ЭтаФорма.Организация   	= ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	ЭтаФорма.Подразделение	= Справочники.Подразделения.ГруппаКомпаний;
	ЭтаФорма.Язык         	= Справочники.Языки.Русский;
	ЭтаФорма.Период			= ТекущаяДата();
	
	ПриЧтенииСозданииНаСервере();
	
	Если ЭтаФорма.Параметры.Свойство("ОткрытьНаСтраницеКонтактныеЛица") И ЭтаФорма.Параметры.ОткрытьНаСтраницеКонтактныеЛица Тогда
		Элементы.ГруппаЗакладки.ТекущаяСтраница = Элементы.СтраницаКонтактныеЛица;
	КонецЕсли;
	
	СоздатьКоманды_СоздатьВнесениеИзмененийВоВнутреннийПеречень();
	
	ПолеКомпоновкиДанныхПоверенный = Новый ПолеКомпоновкиДанных("Поверенные.Поверенный");
	
	Для Каждого ЭлементОтбора Из ЭтаФорма.СписокВходящихДоверенностей.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиДанныхПоверенный Тогда
			ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;	
		КонецЕсли;
	КонецЦикла;	
	
	ЭтаФорма.СписокПаевыхФондов.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", ЭтаФорма.Период);
	ЭтаФорма.СписокПаевыхФондов.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ЭтаФорма.Организация);
	ЭтаФорма.СписокПаевыхФондов.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЮрФизЛицо", Объект.Ссылка);
	
	ЭтаФорма.СписокОрганизацийПоУставу.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", ЭтаФорма.Период);
	ЭтаФорма.СписокОрганизацийПоУставу.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ЭтаФорма.Организация);
	ЭтаФорма.СписокОрганизацийПоУставу.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЮрФизЛицо", Объект.Ссылка);
	
	ЭтаФорма.СписокВыгодоприобретателейБенефициаров.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", ЭтаФорма.Период);
	ЭтаФорма.СписокВыгодоприобретателейБенефициаров.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ЭтаФорма.Организация);
	ЭтаФорма.СписокВыгодоприобретателейБенефициаров.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЮрФизЛицо", Объект.Ссылка);
	
	ЭтаФорма.СписокНаследодателей.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Период", ЭтаФорма.Период);
	ЭтаФорма.СписокНаследодателей.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ЭтаФорма.Организация);
	ЭтаФорма.СписокНаследодателей.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ЮрФизЛицо", Объект.Ссылка);
		
КонецПроцедуры

&НаКлиенте
Процедура АнкетыПриИзменении(Элемент)
	
	ОбновитьДанныеЮрФизЛицаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ФункциональныеРолиРольОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаФункциональныеРоли = Элементы.ФункциональныеРоли.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(СтрокаФункциональныеРоли.СсылкаНаРоль) Тогда
		ФормаФункциональнойОпции = ПолучитьФорму("Справочник." + СтрокаФункциональныеРоли.ВидРоли + ".ФормаОбъекта", Новый Структура("Ключ", СтрокаФункциональныеРоли.СсылкаНаРоль));
		ФормаФункциональнойОпции.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаОбновитьНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Вопрос("Обновить текущий элемент?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		РаботаСВнешнимиСистемами.ОбновитьРеквизитыОбъектаИзМатрикс(Объект.Ссылка, ЭтаФорма.Подразделение, ЭтаФорма.Язык);
		
		ЭтаФорма.Прочитать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатСверкиСМЭВНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отбор = Новый Структура("ЮрФизЛицо, ВидПеречня", 
		Объект.Ссылка,
		ПредопределенноеЗначение("Справочник.ВидыПеречнейОбъектов.СМЭВ")); 
	ПараметрыФормы = Новый Структура("Отбор", Отбор); 
	
	ОткрытьФорму("РегистрСведений.ЖурналСверкиСоСписками.ФормаСписка", ПараметрыФормы, ЭтаФорма, Истина, ЭтаФорма.Окно);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СверитьПоСМЭВ(Организация, ЮрФизЛицо, ИдентификаторПакетаСМЭВ)
    
	Результат = РегистрыСведений.ЖурналСверкиСоСписками.СверитьПоСМЭВ(Организация, ЮрФизЛицо);
	
	Если ЗначениеЗаполнено(Результат) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат);
	КонецЕсли; 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	ВидыЮрФизЛиц = РаботаСМетаданнымиПовтИсп.ЗначенияПеречисленияВСтруктуру("ВидыЮрФизЛиц");

	Элементы.СтраницаОбразованиеИТрудоваяДеятельность.Видимость = (Объект.ВидЮрФизЛица = ВидыЮрФизЛиц.ФизическоеЛицо);
	
КонецПроцедуры // НастроитьВидимостьДоступность

#Область ОбразованиеИТрудоваяДеятельность
	
&НаКлиенте
Процедура КомандаСотрудникиОрганизацииИстория(Команда)
	
	Элементы.СотрудникиОрганизацииКомандаИстория.Пометка = НЕ Элементы.СотрудникиОрганизацииКомандаИстория.Пометка;
	УстановитьСвойстваДинамическогоСпискаСотрудникиОрганизацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваДинамическогоСпискаСотрудникиОрганизацииНаСервере()
	
	ПараметрыДинамическогоСписка = Новый Структура;
	
	Если Элементы.СотрудникиОрганизацииКомандаИстория.Пометка Тогда
		ПараметрыДинамическогоСписка.Вставить("ОсновнаяТаблица", "РегистрСведений.СотрудникиОрганизации");
		ПараметрыДинамическогоСписка.Вставить("ТекстЗапроса", 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РегистрСведенийСотрудникиОрганизации.Период КАК Период,
			|	РегистрСведенийСотрудникиОрганизации.Организация КАК Организация,
			|	РегистрСведенийСотрудникиОрганизации.Сотрудник КАК Сотрудник,
			|	РегистрСведенийСотрудникиОрганизации.Подразделение КАК Подразделение,
			|	РегистрСведенийСотрудникиОрганизации.Должность КАК Должность,
			|	РегистрСведенийСотрудникиОрганизации.ВидСобытия КАК ВидСобытия,
			|	&Период
			|ИЗ
			|	РегистрСведений.СотрудникиОрганизации КАК РегистрСведенийСотрудникиОрганизации
			|ГДЕ
			|	РегистрСведенийСотрудникиОрганизации.Сотрудник.ЮрФизЛицо = &ЮрФизЛицо");
		
		//&Период потому что при переопределении текста запрса, 1с его удалит
	Иначе
		ПараметрыДинамическогоСписка.Вставить("ОсновнаяТаблица", "РегистрСведений.СотрудникиОрганизации.СрезПоследних");
		ПараметрыДинамическогоСписка.Вставить("ТекстЗапроса", 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РегистрСведенийСотрудникиОрганизацииСрезПоследних.Период КАК Период,
			|	РегистрСведенийСотрудникиОрганизацииСрезПоследних.Организация КАК Организация,
			|	РегистрСведенийСотрудникиОрганизацииСрезПоследних.Сотрудник КАК Сотрудник,
			|	РегистрСведенийСотрудникиОрганизацииСрезПоследних.Подразделение КАК Подразделение,
			|	РегистрСведенийСотрудникиОрганизацииСрезПоследних.Должность КАК Должность,
			|	РегистрСведенийСотрудникиОрганизацииСрезПоследних.ВидСобытия КАК ВидСобытия
			|ИЗ
			|	РегистрСведений.СотрудникиОрганизации.СрезПоследних(&Период, Сотрудник.ЮрФизЛицо = &ЮрФизЛицо) КАК РегистрСведенийСотрудникиОрганизацииСрезПоследних
			|ГДЕ
			|	РегистрСведенийСотрудникиОрганизацииСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)");
	
	КонецЕсли;
	
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.СотрудникиОрганизации, ПараметрыДинамическогоСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВнутренниеПеречниИстория(Команда)
	
	Элементы.ВнутренниеПеречниКомандаИстория.Пометка = НЕ Элементы.ВнутренниеПеречниКомандаИстория.Пометка;
	УстановитьСвойстваДинамическогоСпискаВнутренниеПеречниНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваДинамическогоСпискаВнутренниеПеречниНаСервере()
	
	ПараметрыДинамическогоСписка = Новый Структура;
	
	Если Элементы.ВнутренниеПеречниКомандаИстория.Пометка Тогда
		ПараметрыДинамическогоСписка.Вставить("ОсновнаяТаблица", "Документ.ВнесениеИзмененийВоВнутреннийПеречень");
		ПараметрыДинамическогоСписка.Вставить("ТекстЗапроса", 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВнесениеИзмененийВоВнутреннийПеречень.Дата КАК Дата,
			|	ВнесениеИзмененийВоВнутреннийПеречень.Дата КАК Период,
			|	ВнесениеИзмененийВоВнутреннийПеречень.Ссылка КАК Регистратор,
			|	ВнесениеИзмененийВоВнутреннийПеречень.Организация КАК Организация,
			|	ВнесениеИзмененийВоВнутреннийПеречень.Объект КАК Объект,
			|	ВнесениеИзмененийВоВнутреннийПеречень.ВидПеречня КАК ВидПеречня,
			|	ВнесениеИзмененийВоВнутреннийПеречень.ВидИзменения КАК ВидИзменения,
			|	ВнесениеИзмененийВоВнутреннийПеречень.ВидИзменения = ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийПеречней.Включение)
			|		ИЛИ ВнесениеИзмененийВоВнутреннийПеречень.ВидИзменения = ЗНАЧЕНИЕ(Перечисление.ВидыИзмененийПеречней.Изменение) КАК Действует,
			|	&Период КАК Период1
			|ИЗ
			|	Документ.ВнесениеИзмененийВоВнутреннийПеречень КАК ВнесениеИзмененийВоВнутреннийПеречень
			|ГДЕ
			|	ВнесениеИзмененийВоВнутреннийПеречень.Объект = &Объект");
		
		//&Период потому что при переопределении текста запрса, 1с его удалит
		
		Элементы.ВнутренниеПеречниДата.Видимость = Истина; //СКД по умолчанию ставит сортировку по дате, если основная таблица документ
		Элементы.ВнутренниеПеречниПериод.Видимость = Ложь; 
		Элементы.ВнутренниеПеречниВидИзменения.Видимость = Истина;
		
	Иначе
		ПараметрыДинамическогоСписка.Вставить("ОсновнаяТаблица", "РегистрСведений.ВнутренниеПеречни.СрезПоследних");
		ПараметрыДинамическогоСписка.Вставить("ТекстЗапроса", 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ВнесениеИзмененийВоВнутреннийПеречень.Дата КАК Дата,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.Период КАК Период,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.Регистратор КАК Регистратор,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.НомерСтроки КАК НомерСтроки,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.Активность КАК Активность,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.Организация КАК Организация,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.Объект КАК Объект,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.ВидПеречня КАК ВидПеречня,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.Действует КАК Действует,
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.Регистратор.ВидИзменения КАК ВидИзменения
			|ИЗ
			|	РегистрСведений.ВнутренниеПеречни.СрезПоследних(&Период, Объект = &Объект) КАК РегистрСведенийВнутренниеПеречниСрезПоследних
			|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВнесениеИзмененийВоВнутреннийПеречень КАК ВнесениеИзмененийВоВнутреннийПеречень
			|	ПО РегистрСведенийВнутренниеПеречниСрезПоследних.Регистратор = ВнесениеИзмененийВоВнутреннийПеречень.Ссылка
			|ГДЕ
			|	РегистрСведенийВнутренниеПеречниСрезПоследних.Действует");
		
		Элементы.ВнутренниеПеречниДата.Видимость = Ложь;
		Элементы.ВнутренниеПеречниПериод.Видимость = Истина; //период входит в ключ записи для регистра
		Элементы.ВнутренниеПеречниВидИзменения.Видимость = Ложь;
	
	КонецЕсли;
	
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.ВнутренниеПеречни, ПараметрыДинамическогоСписка);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьНомерПоПорядку(КлючЗаписи, Направление)
	
	ИмяРегистра = КлючЗаписи.Метаданные().Имя;
	
	НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(КлючЗаписи.Организация);
	НаборЗаписей.Отбор.ЮрФизЛицо.Установить(КлючЗаписи.ЮрФизЛицо);
	НаборЗаписей.Прочитать();
	
	КоличествоИзмененныхЗаписей = 0;
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Запись.НомерПоПорядку = КлючЗаписи.НомерПоПорядку Тогда
			Запись.НомерПоПорядку = КлючЗаписи.НомерПоПорядку + Направление;
			КоличествоИзмененныхЗаписей = КоличествоИзмененныхЗаписей + 1;
		ИначеЕсли Запись.НомерПоПорядку = КлючЗаписи.НомерПоПорядку + Направление Тогда
			Запись.НомерПоПорядку = КлючЗаписи.НомерПоПорядку;
			КоличествоИзмененныхЗаписей = КоличествоИзмененныхЗаписей + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если КоличествоИзмененныхЗаписей = 2 Тогда
		КлючЗаписи = РегистрыСведений[ИмяРегистра].СоздатьКлючЗаписи(Новый Структура("Организация, ЮрФизЛицо, НомерПоПорядку", КлючЗаписи.Организация, КлючЗаписи.ЮрФизЛицо, КлючЗаписи.НомерПоПорядку + Направление));
		НаборЗаписей.Записать();
	КонецЕсли;
	
	Элементы[ИмяРегистра].Обновить();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьКоманды_СоздатьВнесениеИзмененийВоВнутреннийПеречень()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидЮрФизЛица", Объект.ВидЮрФизЛица);
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыПеречнейОбъектов.Ссылка КАК Ссылка,
		|	ВидыПеречнейОбъектов.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
		|	ПРЕДСТАВЛЕНИЕ(ВидыПеречнейОбъектов.Ссылка) КАК ПредставлениеСсылки
		|ИЗ
		|	Справочник.ВидыПеречнейОбъектов КАК ВидыПеречнейОбъектов
		|ГДЕ
		|	ВЫБОР &ВидЮрФизЛица
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|				ТОГДА ВидыПеречнейОбъектов.Родитель = ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.ВнутренниеПеречни)
		|			КОГДА ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо)
		|				ТОГДА ВидыПеречнейОбъектов.Ссылка В (ЗНАЧЕНИЕ(Справочник.ВидыПеречнейОбъектов.Инсайдеры))
		|		КОНЕЦ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ИмяКоманды = "СоздатьВнесениеИзмененийВоВнутреннийПеречень_" + Выборка.ИмяПредопределенныхДанных;
		
		НоваяКоманда = ЭтаФорма.Команды.Добавить(ИмяКоманды);	
		НоваяКоманда.Действие = "СоздатьВнесениеИзмененийВоВнутреннийПеречень_Подключаемый";
		НоваяКоманда.Заголовок = Выборка.ПредставлениеСсылки;
		НоваяКоманда.ИспользуемаяТаблица = Элементы.ВнутренниеПеречни;
		
		КнопкаФормы = ЭтаФорма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Элементы.ВнутренниеПеречниГруппаСоздать);
		КнопкаФормы.ИмяКоманды	= ИмяКоманды;
		КнопкаФормы.Заголовок	= Выборка.ПредставлениеСсылки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьВнесениеИзмененийВоВнутреннийПеречень_Подключаемый(Команда)
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Объект",		Объект.Ссылка);
	ЗначенияЗаполнения.Вставить("ВидПеречня",	ПредопределенноеЗначение("Справочник.ВидыПеречнейОбъектов." + СтрРазделить(Команда.Имя, "_")[1]));
	
	ОткрытьФорму("Документ.ВнесениеИзмененийВоВнутреннийПеречень.Форма.ФормаДокумента", Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения));
	
КонецПроцедуры

&НаКлиенте
Процедура ВнутренниеПеречниВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если НЕ Элементы.ВнутренниеПеречниКомандаИстория.Пометка Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для открытия перейдите в режим 'История'");
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)
	
	Если Команда.ИспользуемаяТаблица.ТекущиеДанные <> Неопределено Тогда
		ИзменитьНомерПоПорядку(Команда.ИспользуемаяТаблица.ТекущаяСтрока, -1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	
	Если Команда.ИспользуемаяТаблица.ТекущиеДанные <> Неопределено Тогда
		ИзменитьНомерПоПорядку(Команда.ИспользуемаяТаблица.ТекущаяСтрока, 1);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СведенияОКвалификацииОткрытьПрисоединенныеФайлы(Команда)
	
	ТекущиеДанные = Элементы.СведенияОКвалификацииФизическихЛиц.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(ТекущиеДанные.ДокументОКвалификации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ЗаписьАнкеты" Тогда 
		Если Параметр = Объект.Ссылка Тогда 
			
			ПеречитатьАнкетуНаСервере();
			
		КонецЕсли;	
	ИначеЕсли ИмяСобытия = "ЗаписьАнкетыПредставителя" Тогда 
		Если Параметр = Объект.Ссылка Тогда 
			
			ЗаполнитьКлиентскиеРолиНаСервере();	
			
		КонецЕсли;	
	ИначеЕсли ИмяСобытия = "ЗаписьДоверенности" Тогда 
		Если Параметр = Объект.Ссылка Тогда 
			
			ЗаполнитьКлиентскиеРолиНаСервере();	
			
		КонецЕсли;	
	Иначе	
		РаботаСФайловымХранилищемКлиент.ОбновитьСписокПослеДобавленияФайла(ЭтотОбъект, 
			ИмяСобытия, Параметр, Источник, "СведенияОКвалификацииФизическихЛиц");
	КонецЕсли;		

КонецПроцедуры

#КонецОбласти

#Область КлиентскийОтдел

&НаСервере
Процедура ЗаполнитьКлиентскиеРолиНаСервере()
	// Только для физических лиц
	Если Объект.ВидЮрФизЛица <> Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.КлиентскиеРоли.Очистить();
	
	ВидыКлиентскихРолей     = Справочники.ЮрФизЛица.ПолучитьВидыКлиентскихРолей();
	ВыбранныеКлиентскиеРоли 	= ПолучитьКлиентскиеРоли();
	
	Для Каждого ВидКлиентскойРоли Из ВидыКлиентскихРолей Цикл
		СтрокаФункциональныеРоли 		 = ЭтаФорма.КлиентскиеРоли.Добавить();
		СтрокаФункциональныеРоли.Роль    = ВидКлиентскойРоли;
		
		Для Каждого ВыбраннаяКлиентскаяРоль Из ВыбранныеКлиентскиеРоли Цикл
			Если ВыбраннаяКлиентскаяРоль.ВидКлиентскойРоли = ВидКлиентскойРоли Тогда
				СтрокаФункциональныеРоли.Флажок = Истина;
				СтрокаФункциональныеРоли.Подробно = СтрокаФункциональныеРоли.Подробно + ?(ПустаяСтрока(СтрокаФункциональныеРоли.Подробно),"",", ") + ВыбраннаяКлиентскаяРоль.Подробно;
			КонецЕсли;	
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьКлиентскиеРолиНаСервере

&НаСервере
Функция ПолучитьКлиентскиеРоли()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	""Владелец паев"" КАК ВидКлиентскойРоли,
		|	ДолиПайщиковВИнвестиционномФондеОстатки.Пайщик КАК ЮрФизЛицо,
		|	ДолиПайщиковВИнвестиционномФондеОстатки.Организация КАК Организация,
		|	ДолиПайщиковВИнвестиционномФондеОстатки.ПаевойИнвестиционныйФонд.Представление КАК Подробно
		|ИЗ
		|	РегистрНакопления.ДолиПайщиковВИнвестиционномФонде.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И Пайщик.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|				И Пайщик = &ЮрФизЛицо) КАК ДолиПайщиковВИнвестиционномФондеОстатки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО ДолиПайщиковВИнвестиционномФондеОстатки.ПаевойИнвестиционныйФонд = КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|			И ДолиПайщиковВИнвестиционномФондеОстатки.Организация = КлиентыДоверительногоУправленияСрезПоследних.Организация
		|			И (КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения >= &Период)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Владелец паев"",
		|	ЗаявкаПайщика.Пайщик,
		|	ЗаявкаПайщика.Организация,
		|	ЗаявкаПайщика.ПаевойИнвестиционныйФонд.Представление
		|ИЗ
		|	Документ.ЗаявкаПайщика КАК ЗаявкаПайщика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, Организация = &Организация) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО ЗаявкаПайщика.ПаевойИнвестиционныйФонд = КлиентыДоверительногоУправленияСрезПоследних.Клиент
		|			И ЗаявкаПайщика.Организация = КлиентыДоверительногоУправленияСрезПоследних.Организация
		|			И (КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|				ИЛИ КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.ДатаРасторжения > &Период)
		|ГДЕ
		|	ЗаявкаПайщика.Организация = &Организация
		|	И ЗаявкаПайщика.Пайщик = &ЮрФизЛицо
		|	И ЗаявкаПайщика.Многократная = ИСТИНА
		|	И НЕ ЗаявкаПайщика.ПометкаУдаления
		|	И ЗаявкаПайщика.Пайщик.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Клиент ИДУ"",
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент,
		|	КлиентыДоверительногоУправленияСрезПоследних.Организация,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.НомерДоговора
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Клиент = &ЮрФизЛицо
		|				И (СчетДоверительногоУправления.ДатаРасторжения > &Период
		|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|				И Клиент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|				И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления <> ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)) КАК КлиентыДоверительногоУправленияСрезПоследних
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(КлиентыДоверительногоУправленияСрезПоследних.Клиент) = ТИП(Справочник.ЮрФизЛица)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Клиент ИИС"",
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент,
		|	КлиентыДоверительногоУправленияСрезПоследних.Организация,
		|	КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления.НомерДоговора
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Клиент = &ЮрФизЛицо
		|				И (СчетДоверительногоУправления.ДатаРасторжения > &Период
		|					ИЛИ СчетДоверительногоУправления.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1))
		|				И Клиент.ВидЮрФизЛица = ЗНАЧЕНИЕ(Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо)
		|				И СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.ИндивидуальныйИнвестиционныйСчет)) КАК КлиентыДоверительногоУправленияСрезПоследних
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(КлиентыДоверительногоУправленияСрезПоследних.Клиент) = ТИП(Справочник.ЮрФизЛица)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Представитель юр лица по Доверенности"",
		|	ДоверенностиПоверенные.Поверенный,
		|	ДоверенностиПоверенные.Ссылка.Организация,
		|	ДоверенностиПоверенные.Ссылка.Доверитель.Представление
		|ИЗ
		|	Справочник.Доверенности.Поверенные КАК ДоверенностиПоверенные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыМЧД.СрезПоследних(&Период, ) КАК СтатусыМЧДСрезПоследних
		|		ПО ДоверенностиПоверенные.Ссылка = СтатусыМЧДСрезПоследних.Доверенность
		|			И ДоверенностиПоверенные.Ссылка.Организация = СтатусыМЧДСрезПоследних.Организация
		|ГДЕ
		|	ДоверенностиПоверенные.Ссылка.Организация = &Организация
		|	И ДоверенностиПоверенные.Поверенный = &ЮрФизЛицо
		|	И НЕ ДоверенностиПоверенные.Ссылка.ПометкаУдаления
		|	И ДоверенностиПоверенные.Ссылка.ВидДоверенности = ЗНАЧЕНИЕ(Перечисление.ВидыДоверенностей.Входящая)
		|	И (ДоверенностиПоверенные.Ссылка.ДатаОкончанияДействия >= &Период
		|			ИЛИ ДоверенностиПоверенные.Ссылка.ДатаОкончанияДействия = ДАТАВРЕМЯ(1, 1, 1))
		|	И (ДоверенностиПоверенные.Ссылка.ДатаОтзыва >= &Период
		|			ИЛИ ДоверенностиПоверенные.Ссылка.ДатаОтзыва = ДАТАВРЕМЯ(1, 1, 1))
		|	И ЕСТЬNULL(СтатусыМЧДСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.СтатусыМашиночитаемойДоверенностиВРеестреФНС.Отозвано)
		|	И ЕСТЬNULL(СтатусыМЧДСрезПоследних.Статус, ЗНАЧЕНИЕ(Перечисление.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Перечисление.СтатусыМашиночитаемойДоверенностиВРеестреФНС.ИстекСрокДействия)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Представитель юр лица по Уставу"",
		|	АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Организация,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо.Представление
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АнкетаЮридическогоЛица.ПредставителиВыгодоприобретатели КАК АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели
		|		ПО РеквизитыЮридическихЛицАнкетныеСрезПоследних.Регистратор = АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.Ссылка
		|ГДЕ
		|	АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо = &ЮрФизЛицо
		|	И АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ПоУставу
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	""Выгодоприобретатель"",
		|	АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Организация,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо.Представление
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АнкетаЮридическогоЛица.ПредставителиВыгодоприобретатели КАК АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели
		|		ПО РеквизитыЮридическихЛицАнкетныеСрезПоследних.Регистратор = АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.Ссылка
		|ГДЕ
		|	АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ВидУчастника = ЗНАЧЕНИЕ(Перечисление.ВидыУчастниковАнкет.Выгодоприобретатель)
		|	И АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо = &ЮрФизЛицо
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	""Бенефициарный владелец"",
		|	АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Организация,
		|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ЮрФизЛицо.Представление
		|ИЗ
		|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АнкетаЮридическогоЛица.ПредставителиВыгодоприобретатели КАК АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели
		|		ПО РеквизитыЮридическихЛицАнкетныеСрезПоследних.Регистратор = АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.Ссылка
		|ГДЕ
		|	(АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ВидУчастника = ЗНАЧЕНИЕ(Перечисление.ВидыУчастниковАнкет.БенефициарныйВладелец)
		|			ИЛИ АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ВидУчастника = ЗНАЧЕНИЕ(Перечисление.ВидыУчастниковАнкет.БенефициарныйВладелецУстановленныйКомпанией))
		|	И АнкетаЮридическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо = &ЮрФизЛицо
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	""Наследник"",
		|	АнкетаФизическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Организация.Представление,
		|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ЮрФизЛицо.Представление
		|ИЗ
		|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АнкетаФизическогоЛица.ПредставителиВыгодоприобретатели КАК АнкетаФизическогоЛицаПредставителиВыгодоприобретатели
		|		ПО РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор = АнкетаФизическогоЛицаПредставителиВыгодоприобретатели.Ссылка
		|ГДЕ
		|	АнкетаФизическогоЛицаПредставителиВыгодоприобретатели.ВидУчастника = ЗНАЧЕНИЕ(Перечисление.ВидыУчастниковАнкет.Выгодоприобретатель)
		|	И АнкетаФизическогоЛицаПредставителиВыгодоприобретатели.ЮрФизЛицо = &ЮрФизЛицо";		
	
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("Период", ЭтаФорма.Период);
	Запрос.УстановитьПараметр("ЮрФизЛицо", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции	

&НаКлиенте
Процедура ОбновитьКлиентскиеРоли(Команда)
	ЗаполнитьКлиентскиеРолиНаСервере();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура СоздатьАнкету(Команда)
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Анкета) Тогда
		
		ПараметрыФормы = Новый Структура("ЗначениеКопирования", ЭтотОбъект.Анкета);
		
	Иначе 
		
		Основание = Новый Структура;
		Основание.Вставить("ЮрФизЛицо", Объект.Ссылка);
		Основание.Вставить("Организация", ЭтаФорма.Организация);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Основание", Основание);
		
	КонецЕсли;	
	
	Если Объект.ВидЮрФизЛица = ПредопределенноеЗначение("Перечисление.ВидыЮрФизЛиц.ФизическоеЛицо") Тогда
		
        ОткрытьФорму("Документ.АнкетаФизическогоЛица.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);		
		
	Иначе
		
        ОткрытьФорму("Документ.АнкетаЮридическогоЛица.ФормаОбъекта", ПараметрыФормы, ЭтаФорма);		
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПеречитатьАнкетуНаСервере()
	
	// Определелим текущую анкету, если она есть
	Если Объект.ВидЮрФизЛица = Перечисления.ВидыЮрФизЛиц.ФизическоеЛицо Тогда
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Регистратор КАК Регистратор
			|ИЗ
			|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
			|			,
			|			Организация = &Организация
			|				И ЮрФизЛицо = &ЮрФизЛицо
			|				И Язык = &Язык) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних");
		Элементы.Анкета.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.АнкетаФизическогоЛица");
	Иначе
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.Регистратор КАК Регистратор
			|ИЗ
			|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
			|			,
			|			Организация = &Организация
			|				И ЮрФизЛицо = &ЮрФизЛицо
			|				И Язык = &Язык) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних");
		Элементы.Анкета.ОграничениеТипа = Новый ОписаниеТипов("ДокументСсылка.АнкетаЮридическогоЛица");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЮрФизЛицо",   Объект.Ссылка);
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("Язык",        ЭтаФорма.Язык);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ЭтаФорма.Анкета = Выборка.Регистратор;
		
	КонецЕсли;
	
	ОбновитьДанныеЮрФизЛицаНаСервере();
	
КонецПроцедуры	

&НаКлиенте
Процедура КлиентскиеРолиПриАктивизацииСтроки(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект = Форма.Объект;
	
	Форма.Элементы.СписокВходящихДоверенностей.Видимость = Ложь;	
	Форма.Элементы.СписокПаевыхФондов.Видимость = Ложь;	
	Форма.Элементы.СписокСчетовДУРоли.Видимость = Ложь;
	Форма.Элементы.СписокОрганизацийПоУставу.Видимость = Ложь;
	Форма.Элементы.СписокВыгодоприобретателейБенефициаров.Видимость = Ложь;
	Форма.Элементы.СписокНаследодателей.Видимость = Ложь;
	
	Если Форма.Элементы.КлиентскиеРоли.ТекущиеДанные.Роль = "Представитель юр лица по Доверенности" Тогда
		Форма.Элементы.СписокВходящихДоверенностей.Видимость = Истина;	
	ИначеЕсли Форма.Элементы.КлиентскиеРоли.ТекущиеДанные.Роль = "Владелец паев" Тогда
		Форма.Элементы.СписокПаевыхФондов.Видимость = Истина;	
	ИначеЕсли Форма.Элементы.КлиентскиеРоли.ТекущиеДанные.Роль = "Клиент ИДУ" Тогда
		Форма.Элементы.СписокСчетовДУРоли.Видимость = Истина;
	ИначеЕсли Форма.Элементы.КлиентскиеРоли.ТекущиеДанные.Роль = "Клиент ИИС" Тогда
		Форма.Элементы.СписокСчетовДУРоли.Видимость = Истина;
	ИначеЕсли Форма.Элементы.КлиентскиеРоли.ТекущиеДанные.Роль = "Представитель юр лица по Уставу" Тогда
		Форма.Элементы.СписокОрганизацийПоУставу.Видимость = Истина;
	ИначеЕсли Форма.Элементы.КлиентскиеРоли.ТекущиеДанные.Роль = "Бенефициарный владелец" Тогда
		
		Для Каждого ЭлементОтбора Из Форма.СписокВыгодоприобретателейБенефициаров.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если ЭлементОтбора.Представление = "Бенефициар" Тогда
				ЭлементОтбора.Использование = Истина;	
			Иначе	
				ЭлементОтбора.Использование = Ложь;	
			КонецЕсли;	
		КонецЦикла;		
		
		Форма.Элементы.СписокВыгодоприобретателейБенефициаров.Видимость = Истина;
		
	ИначеЕсли Форма.Элементы.КлиентскиеРоли.ТекущиеДанные.Роль = "Выгодоприобретатель" Тогда
		Форма.Элементы.СписокВыгодоприобретателейБенефициаров.Видимость = Истина;
		
		Для Каждого ЭлементОтбора Из Форма.СписокВыгодоприобретателейБенефициаров.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			Если ЭлементОтбора.Представление = "Выгодоприобретатель" Тогда
				ЭлементОтбора.Использование = Истина;	
			Иначе	
				ЭлементОтбора.Использование = Ложь;	
			КонецЕсли;	
		КонецЦикла;		
		
		Форма.Элементы.СписокВыгодоприобретателейБенефициаров.Видимость = Истина;
		
	ИначеЕсли Форма.Элементы.КлиентскиеРоли.ТекущиеДанные.Роль = "Наследник" Тогда
		Форма.Элементы.СписокНаследодателей.Видимость = Истина;
	КонецЕсли;	

КонецПроцедуры
